Repository: Symb0x76/bTranslator
Catalog: src/bTranslator.App/Strings/*/Resources.resw
Source language: en_us
Languages: zh_cn

# WindowTitle.ProviderConfiguration
source: Provider Configuration
zh_cn: Provider 配置

# UiLanguage.SystemDefault
source: System default
zh_cn: 跟随系统

# UiLanguage.ChineseSimplified
source: Chinese (Simplified)
zh_cn: 简体中文

# Language.English
source: English
zh_cn: 英语

# Language.ChineseSimplified
source: Chinese (Simplified)
zh_cn: 简体中文

# Language.Japanese
source: Japanese
zh_cn: 日语

# Language.Korean
source: Korean
zh_cn: 韩语

# ListFilter.All
source: All
zh_cn: 全部

# EncodingMode.AutoDetect
source: Auto Detect
zh_cn: 自动检测

# EncodingMode.Manual
source: Manual
zh_cn: 手动

# RowQuality.Locked
source: Locked
zh_cn: 已锁定

# RowQuality.Validated
source: Validated
zh_cn: 已验证

# RowQuality.Pending
source: Pending
zh_cn: 待翻译

# RowQuality.Draft
source: Draft
zh_cn: 草稿

# WorkspaceTitle.Format
source: {0} Workspace
zh_cn: {0} 工作区

# WorkspaceTitle.CompatibilityModeFormat
source: {0} Mode
zh_cn: {0} 模式

# CompatibilityMode.None
source: Workspace
zh_cn: 工作区

# PluginSwitcher.CurrentPlugin
source: Current Plugin
zh_cn: 当前插件

# Status.Ready
source: Ready
zh_cn: 就绪

# Status.MetadataRefreshed
source: Metadata refreshed.
zh_cn: 元数据已刷新。

# Status.ShortcutMappingsSaved
source: Keyboard shortcut mappings updated.
zh_cn: 快捷键映射已更新。

# Status.ShortcutMappingsReset
source: Keyboard shortcut mappings reset to defaults.
zh_cn: 快捷键映射已恢复默认。

# Status.PlaceholderCheckFailed
source: Placeholder pipeline check failed.
zh_cn: 占位符流程校验失败。

# Status.PluginPathMissing
source: Plugin path is empty or file does not exist.
zh_cn: 插件路径为空或文件不存在。

# Status.OpenedPlugin
source: Opened '{0}' ({1}).
zh_cn: 已打开“{0}”（{1}）。

# Status.OpenFailed
source: Open failed: {0}
zh_cn: 打开失败：{0}

# Status.NoActivePlugin
source: No active plugin document. Open a plugin first.
zh_cn: 当前没有活动插件文档，请先打开插件。

# Status.SavedWorkspace
source: Saved workspace to '{0}' ({1}).
zh_cn: 工作区已保存到“{0}”（{1}）。

# Status.SaveFailed
source: Save failed: {0}
zh_cn: 保存失败：{0}

# Status.NoPendingRows
source: No pending rows to translate.
zh_cn: 没有待翻译条目。

# Status.NoAvailableProvider
source: No model selected or provider unavailable.
zh_cn: 未选择模型或对应 Provider 不可用。

# Status.BatchTranslationDone
source: Batch translation done by '{0}', updated {1} rows.
zh_cn: 批量翻译完成，使用“{0}”，更新 {1} 条。

# Status.BatchTranslationFailed
source: Batch translation failed: {0}
zh_cn: 批量翻译失败：{0}

# Status.PluginFileNotFound
source: Plugin file not found: '{0}'.
zh_cn: 未找到插件文件：“{0}”。

# Status.NoProviderSelected
source: No model selected.
zh_cn: 未选择模型。

# Status.UiLanguageChangedRestart
source: UI language switched to '{0}'. Restart the app to apply all texts.
zh_cn: UI 语言已切换为“{0}”，重启应用后可完整生效。

# Status.FilePickerUnavailable
source: Cannot open file picker: main window handle unavailable.
zh_cn: 无法打开文件选择器：主窗口句柄不可用。

# Status.ProviderSettingsSaved
source: Saved provider settings for '{0}'.
zh_cn: 已保存“{0}”的 Provider 配置。

# Status.ProviderSettingsSaveFailed
source: Save provider settings failed: {0}
zh_cn: 保存 Provider 配置失败：{0}

# Status.ProviderSettingsReloaded
source: Reloaded provider settings for '{0}'.
zh_cn: 已重载“{0}”的 Provider 配置。

# Status.ProviderNotRegistered
source: Provider '{0}' is not registered.
zh_cn: Provider “{0}”未注册。

# Status.ProviderConnectivityOk
source: Provider '{0}' connectivity OK.
zh_cn: Provider “{0}”连通性正常。

# Status.ProviderTestFailedWithKind
source: Provider '{0}' test failed ({1}): {2}
zh_cn: Provider “{0}”测试失败（{1}）：{2}

# Status.ProviderTestFailed
source: Provider '{0}' test failed: {1}
zh_cn: Provider “{0}”测试失败：{1}

# Status.ApiTranslatorPathMissing
source: ApiTranslator config path is empty or file does not exist.
zh_cn: ApiTranslator 配置路径为空或文件不存在。

# Status.NoProviderSettingsInApiTranslator
source: No provider settings found in ApiTranslator config.
zh_cn: ApiTranslator 配置中未找到 Provider 设置。

# Status.ApiTranslatorImported
source: Imported ApiTranslator config from '{0}' ({1} providers).
zh_cn: 已从“{0}”导入 ApiTranslator 配置（{1} 个 Provider）。

# Status.ApiTranslatorImportFailed
source: Import ApiTranslator config failed: {0}
zh_cn: 导入 ApiTranslator 配置失败：{0}

# Status.DictionaryPathMissing
source: Dictionary path is empty or file does not exist.
zh_cn: 词典路径为空或文件不存在。

# Status.DictionaryImported
source: Imported dictionary from '{0}' ({1} entries).
zh_cn: 已从“{0}”导入词典（{1} 条词条）。

# Status.DictionaryImportFailed
source: Import dictionary failed: {0}
zh_cn: 导入词典失败：{0}

# Status.DictionaryExported
source: Exported dictionary to '{0}' ({1} entries).
zh_cn: 已导出词典到“{0}”（{1} 条词条）。

# Status.DictionaryExportFailed
source: Export dictionary failed: {0}
zh_cn: 导出词典失败：{0}

# Status.DictionaryUpdated
source: Dictionary updated ({0} entries).
zh_cn: 词典已更新（{0} 条）。

# Status.DictionaryEditorSaveFailed
source: Save dictionary editor changes failed: {0}
zh_cn: 保存词典编辑器修改失败：{0}

# Status.DictionarySeedRowMissing
source: No selected row for dictionary entry.
zh_cn: 当前未选中任何行，无法生成词典词条。

# Status.DictionarySeedMissingSourceOrTarget
source: Selected row source/translation is empty, cannot create dictionary entry.
zh_cn: 当前行源文或译文为空，无法生成词典词条。

# Status.DictionarySeedAdded
source: Added scoped dictionary entry from selected row: {0} / {1}.
zh_cn: 已根据当前选中行添加作用域词条：{0} / {1}。

# Status.DictionarySeedDuplicate
source: Scoped dictionary entry already exists.
zh_cn: 作用域词条已存在，无需重复添加。

# Status.DictionaryPasteNoEntries
source: No valid dictionary entries found in pasted text.
zh_cn: 粘贴内容中未找到有效词条。

# Status.DictionaryPasteImported
source: Parsed {0} entries from pasted text, added {1} after dedupe.
zh_cn: 已从粘贴内容解析 {0} 条，去重后新增 {1} 条。

# Status.EspCompareNoActiveWorkspace
source: No active workspace. Open a plugin before ESP compare.
zh_cn: 当前没有已打开的工作区，请先打开插件后再进行 ESP 对比。

# Status.EspComparePathMissing
source: Compare ESP path is empty or file does not exist.
zh_cn: 对比 ESP 路径为空或文件不存在。

# Status.EspCompareCompleted
source: ESP compare done. Matched {0}, source diff {1}, translation diff {2}, replaceable {3}, missing in compare {4}, missing in current {5}.
zh_cn: ESP 对比完成。匹配 {0}，源文差异 {1}，译文差异 {2}，可替换 {3}，对比缺失 {4}，当前缺失 {5}。

# Status.EspCompareFailed
source: ESP compare failed: {0}
zh_cn: ESP 对比失败：{0}

# Status.EspCompareNoPendingReplacements
source: No pending replacements from ESP compare.
zh_cn: 没有可应用的 ESP 对比替换项。

# Status.EspCompareApplied
source: Applied {0} replacements ({1} locked skipped, {2} source mismatch skipped).
zh_cn: 已应用 {0} 条替换（锁定跳过 {1}，源文不一致跳过 {2}）。

# Status.McmPathMissing
source: MCM/XML path is empty or file does not exist.
zh_cn: MCM/XML 路径为空或文件不存在。

# Status.McmModeOpened
source: Opened MCM/XML mode from '{0}' ({1} rows).
zh_cn: 已从“{0}”打开 MCM/XML 模式（{1} 行）。

# Status.McmModeOpenFailed
source: Open MCM/XML mode failed: {0}
zh_cn: 打开 MCM/XML 模式失败：{0}

# Status.McmModeNotActive
source: MCM/XML mode is not active. Open an MCM/XML file first.
zh_cn: 当前未处于 MCM/XML 模式，请先打开 MCM/XML 文件。

# Status.McmModeExported
source: Exported MCM/XML mode to '{0}' ({1} rows).
zh_cn: 已导出 MCM/XML 模式到“{0}”（{1} 行）。

# Status.McmModeExportFailed
source: Export MCM/XML mode failed: {0}
zh_cn: 导出 MCM/XML 模式失败：{0}

# Status.TxtPathMissing
source: TXT/SST path is empty or file does not exist.
zh_cn: TXT/SST 路径为空或文件不存在。

# Status.TxtModeOpened
source: Opened TXT/SST mode from '{0}' ({1} rows).
zh_cn: 已从“{0}”打开 TXT/SST 模式（{1} 行）。

# Status.TxtModeOpenFailed
source: Open TXT/SST mode failed: {0}
zh_cn: 打开 TXT/SST 模式失败：{0}

# Status.TxtModeNotActive
source: TXT/SST mode is not active. Open a TXT/SST file first.
zh_cn: 当前未处于 TXT/SST 模式，请先打开 TXT/SST 文件。

# Status.TxtModeExported
source: Exported TXT/SST mode to '{0}' ({1} rows).
zh_cn: 已导出 TXT/SST 模式到“{0}”（{1} 行）。

# Status.TxtModeExportFailed
source: Export TXT/SST mode failed: {0}
zh_cn: 导出 TXT/SST 模式失败：{0}

# Status.TxtBatchScriptPathMissing
source: TXT batch script path is empty or file does not exist.
zh_cn: TXT 批处理脚本路径为空或文件不存在。

# Status.TxtBatchScriptApplied
source: TXT batch script '{0}' applied, changed {1} rows.
zh_cn: TXT 批处理脚本“{0}”已应用，变更 {1} 行。

# Status.TxtBatchScriptFailed
source: TXT batch script failed: {0}
zh_cn: TXT 批处理脚本执行失败：{0}

# Status.PexPathMissing
source: PEX path is empty or file does not exist.
zh_cn: PEX 路径为空或文件不存在。

# Status.PexModeOpened
source: Opened PEX mode from '{0}' ({1} strings).
zh_cn: 已从“{0}”打开 PEX 模式（{1} 条字符串）。

# Status.PexModeOpenFailed
source: Open PEX mode failed: {0}
zh_cn: 打开 PEX 模式失败：{0}

# Status.PexNoActiveDocument
source: PEX mode is not active. Open a PEX file first.
zh_cn: 当前未处于 PEX 模式，请先打开 PEX 文件。

# Status.PexStringsExported
source: Exported PEX strings to '{0}' ({1} rows).
zh_cn: 已导出 PEX 字符串到“{0}”（{1} 行）。

# Status.PexStringsExportFailed
source: Export PEX strings failed: {0}
zh_cn: 导出 PEX 字符串失败：{0}

# Status.ProviderSettingsLoadFailed
source: Load provider settings failed: {0}
zh_cn: 加载 Provider 配置失败：{0}

# InspectorHint.SelectRow
source: Select a row to review placeholders and terminology consistency.
zh_cn: 选择一条记录以检查占位符与术语一致性。

# InspectorHint.RowLocked
source: Current row is locked. Unlock it before writing translations.
zh_cn: 当前记录已锁定，写入翻译前请先解锁。

# InspectorHint.KeepPlaceholders
source: Keep tags and number placeholders unchanged during translation.
zh_cn: 翻译时请保持标签和数字占位符不变。

# InspectorHint.GlossaryMismatch
source: Selected glossary term does not match current source text.
zh_cn: 所选术语与当前源文本不匹配。

# Log.AppliedManualEdit
source: Applied manual edit to '{0}'.
zh_cn: 已将手动编辑应用到“{0}”。

# Log.CopiedSourceToTarget
source: Copied source text to target for '{0}'.
zh_cn: 已将源文本复制到“{0}”的译文。

# Log.MarkedValidated
source: Marked '{0}' as validated.
zh_cn: 已将“{0}”标记为已验证。

# Log.RowLocked
source: Locked '{0}'.
zh_cn: 已锁定“{0}”。

# Log.RowUnlocked
source: Unlocked '{0}'.
zh_cn: 已解锁“{0}”。

# Log.AppliedGlossarySuggestion
source: Applied glossary suggestion '{0}' to '{1}'.
zh_cn: 已将术语建议“{0}”应用到“{1}”。

# Log.ProviderConnectivitySample
source: {0} Sample: {1}
zh_cn: {0} 示例：{1}

# Log.DictionaryPreReplaceRows
source: Dictionary pre-replace prepared {0} rows before AI translation.
zh_cn: 已在 AI 翻译前为 {0} 条记录应用词典预替换。

# Log.EspCompareCandidateSample
source: ESP candidate: {0}/{1} | '{2}' -> '{3}'
zh_cn: ESP 候选：{0}/{1} | '{2}' -> '{3}'

# Log.TxtBatchSample
source: TXT batch: {0}
zh_cn: TXT 批处理：{0}

# Shortcut.Open
source: {0} Open
zh_cn: {0} 打开

# Shortcut.Save
source: {0} Save
zh_cn: {0} 保存

# Shortcut.AiBatch
source: {0} AI Batch
zh_cn: {0} 批量 AI

# Shortcut.Search
source: {0} Search
zh_cn: {0} 搜索

# Shortcut.FocusRows
source: {0} Rows
zh_cn: {0} 行列表

# Shortcut.FocusInspector
source: {0} Inspector
zh_cn: {0} 检查器

# Shortcut.FocusAiInput
source: {0} Copilot
zh_cn: {0} Copilot 输入

# Shortcut.FocusModel
source: {0} Model
zh_cn: {0} 模型

# Shortcut.ClearAiChat
source: {0} Clear Copilot
zh_cn: {0} 清空 Copilot

# Shortcut.Apply
source: {0} Apply
zh_cn: {0} 应用

# Shortcut.ApplyNext
source: {0} Apply+Next
zh_cn: {0} 应用并下一条

# Shortcut.CopySource
source: {0} CopySource
zh_cn: {0} 复制源文

# Shortcut.ToggleLock
source: {0} Lock
zh_cn: {0} 切换锁定

# Shortcut.Validate
source: {0} Validate
zh_cn: {0} 标记验证

# Shortcut.NextPending
source: {0} NextPending
zh_cn: {0} 下一个待翻译

# Shortcut.PrevPending
source: {0} PrevPending
zh_cn: {0} 上一个待翻译

# Shortcut.Help
source: {0} Help
zh_cn: {0} 快捷键帮助

# ShortcutGroup.File
source: File
zh_cn: 文件

# ShortcutGroup.Translate
source: Translate
zh_cn: 翻译

# ShortcutGroup.Navigation
source: Navigation
zh_cn: 导航

# ShortcutGroup.Editing
source: Editing
zh_cn: 编辑

# ShortcutHelp.DialogTitle
source: Keyboard Shortcuts
zh_cn: 快捷键帮助

# ShortcutHelp.ConfigureButton
source: Configure...
zh_cn: 配置...

# ShortcutHelp.CloseButton
source: Close
zh_cn: 关闭

# ShortcutHelp.SearchPlaceholder
source: Filter by key or description
zh_cn: 按按键或说明筛选

# ShortcutHelp.NoResults
source: No shortcuts match current filter.
zh_cn: 没有匹配当前筛选的快捷键。

# ShortcutHelp.Open
source: Open plugin and load workspace
zh_cn: 打开插件并加载工作区

# ShortcutHelp.Save
source: Save current workspace
zh_cn: 保存当前工作区

# ShortcutHelp.BatchTranslate
source: Run batch translation via selected model
zh_cn: 按当前所选模型执行批量翻译

# ShortcutHelp.Refresh
source: Reload metadata and workspace settings
zh_cn: 重载元数据与工作区设置

# ShortcutHelp.FocusSearch
source: Focus search box
zh_cn: 聚焦到搜索框

# ShortcutHelp.FocusRows
source: Focus translation rows list
zh_cn: 聚焦到翻译行列表

# ShortcutHelp.FocusInspector
source: Focus inspector translation editor
zh_cn: 聚焦到检查器译文输入框

# ShortcutHelp.FocusAiInput
source: Focus AI chat input
zh_cn: 聚焦到 AI 对话输入框

# ShortcutHelp.FocusModel
source: Focus model filter
zh_cn: 聚焦到模型筛选框

# ShortcutHelp.ClearAiChat
source: Clear Copilot conversation history
zh_cn: 清空 Copilot 对话历史

# ShortcutHelp.ApplyInspector
source: Apply inspector translation to current row
zh_cn: 将检查器译文应用到当前行

# ShortcutHelp.ApplyAndNext
source: Apply and jump to next pending row
zh_cn: 应用并跳转到下一条待翻译

# ShortcutHelp.CopySource
source: Copy source text into translation box
zh_cn: 将源文复制到译文输入框

# ShortcutHelp.ToggleLock
source: Toggle lock state for selected row
zh_cn: 切换所选行的锁定状态

# ShortcutHelp.MarkValidated
source: Mark selected row as validated
zh_cn: 将所选行标记为已验证

# ShortcutHelp.AiSend
source: Send message from AI input
zh_cn: 在 AI 输入框中发送消息

# ShortcutHelp.AiNewLine
source: Insert new line in AI input
zh_cn: 在 AI 输入框中插入换行

# ShortcutHelp.NextPending
source: Select next pending row
zh_cn: 选择下一条待翻译

# ShortcutHelp.PreviousPending
source: Select previous pending row
zh_cn: 选择上一条待翻译

# ShortcutHelp.ShowHelp
source: Open this keyboard shortcut help
zh_cn: 打开此快捷键帮助弹窗

# ShortcutConfig.DialogTitle
source: Configure Keyboard Shortcuts
zh_cn: 配置快捷键

# ShortcutConfig.SearchPlaceholder
source: Filter actions or gestures
zh_cn: 按操作说明或按键筛选

# ShortcutConfig.NoResults
source: No shortcut action matches current filter.
zh_cn: 没有匹配当前筛选的快捷键操作。

# ShortcutConfig.Instruction
source: Use format like Ctrl+Shift+K. Save applies immediately.
zh_cn: 格式示例：Ctrl+Shift+K。保存后立即生效。

# ShortcutConfig.SaveButton
source: Save
zh_cn: 保存

# ShortcutConfig.ResetButton
source: Reset Defaults
zh_cn: 恢复默认

# ShortcutConfig.CancelButton
source: Cancel
zh_cn: 取消

# ShortcutConfig.EmptyGestureError
source: Shortcut for '{0}' cannot be empty.
zh_cn: “{0}” 的快捷键不能为空。

# ShortcutConfig.InvalidGestureError
source: Shortcut '{0}' for '{1}' is invalid.
zh_cn: “{1}” 的快捷键“{0}”无效。

# ShortcutConfig.DuplicateGestureError
source: Shortcut '{0}' conflicts between '{1}' and '{2}'.
zh_cn: 快捷键“{0}”冲突：{1} 与 {2}。

# MainMenuFile.Title
source: File
zh_cn: 文件

# MainMenuTranslate.Title
source: Translate
zh_cn: 翻译

# MainMenuView.Title
source: View
zh_cn: 视图

# MainMenuActions.Title
source: Actions
zh_cn: 操作

# MainMenuWorkspace.Title
source: Workspace
zh_cn: 工作区

# WorkspaceMenuUiLanguage.Text
source: UI Language
zh_cn: 界面语言

# WorkspaceMenuGame.Text
source: Game
zh_cn: 游戏

# WorkspaceMenuSourceLanguage.Text
source: Source Language
zh_cn: 源语言

# WorkspaceMenuTargetLanguage.Text
source: Target Language
zh_cn: 目标语言

# WorkspaceMenuEncodingMode.Text
source: Encoding Mode
zh_cn: 编码模式

# WorkspaceMenuEncodingManual.Text
source: Encoding (Manual)
zh_cn: 编码（手动）

# WorkspaceMenuApplyEncoding.Text
source: Apply Encoding (Reopen)
zh_cn: 应用编码（重新打开）

# PluginSwitcherTitle.Text
source: Plugin Switcher
zh_cn: 插件切换器

# PluginSwitcherSearchBox.PlaceholderText
source: Search by plugin name or path
zh_cn: 按插件名称或路径搜索

# PluginSwitcherPinButton.ToolTipService.ToolTip
source: Pin or unpin plugin
zh_cn: 固定或取消固定插件

# PluginSwitcherOpenButton.Content
source: Open Plugin...
zh_cn: 打开插件...

# PluginSwitcherSaveButton.Content
source: Save
zh_cn: 保存

# MetricsTotalRowsLabel.Text
source: Total Rows
zh_cn: 总条目

# MetricsTranslatedLabel.Text
source: Translated
zh_cn: 已翻译

# MetricsPendingLabel.Text
source: Pending
zh_cn: 待翻译

# MetricsCompletionLabel.Text
source: Completion
zh_cn: 完成率

# MainSearchBox.Header
source: Search
zh_cn: 搜索

# MainSearchBox.PlaceholderText
source: EDID / Source / Translation / Field
zh_cn: EDID / 源文 / 译文 / 字段

# MainListFilterBox.Header
source: List
zh_cn: 列表

# MainOnlyPendingToggle.Header
source: Only Pending
zh_cn: 仅待翻译

# MainIncludeLockedToggle.Header
source: Include Locked
zh_cn: 包含锁定

# MainTableHeaderField.Text
source: Field
zh_cn: 字段

# MainTableHeaderSource.Text
source: Source
zh_cn: 源文

# MainTableHeaderTranslation.Text
source: Translation
zh_cn: 译文

# InspectorSectionTitle.Text
source: Row Inspector
zh_cn: 行检查器

# InspectorFieldLabel.Text
source: Field
zh_cn: 字段

# InspectorSourceBox.Header
source: Source
zh_cn: 源文

# InspectorTranslationBox.Header
source: Translation
zh_cn: 译文

# InspectorApplyButton.Content
source: Apply
zh_cn: 应用

# InspectorCopySourceButton.Content
source: Copy Source
zh_cn: 复制源文

# InspectorMarkValidatedButton.Content
source: Mark Validated
zh_cn: 标记已验证

# InspectorToggleLockButton.Content
source: Toggle Lock
zh_cn: 切换锁定

# InspectorAddToDictionaryButton.Content
source: Add To Dictionary
zh_cn: 加入词典

# InspectorProviderMovedHint.Text
source: Provider configuration has moved to Actions -> Provider -> Configuration -> Open Configuration Window.
zh_cn: Provider 配置已移动到 Actions -> Provider -> Configuration -> Open Configuration Window。

# ProviderConfigPageTitle.Text
source: Provider Configuration
zh_cn: Provider 配置

# ProviderConfigProviderBox.Header
source: Model
zh_cn: 模型

# ProviderConfigSelectedProviderTitle.Text
source: Selected Provider
zh_cn: 当前 Provider

# ProviderConfigApiKeyBox.PlaceholderText
source: Stored securely via DPAPI
zh_cn: 通过 DPAPI 安全存储

# ProviderConfigApiSecretBox.PlaceholderText
source: For Baidu/Tencent dual-key providers
zh_cn: 用于 Baidu/Tencent 双密钥 Provider

# ProviderConfigSessionTokenBox.Header
source: Session Token (optional, DPAPI)
zh_cn: Session Token（可选，DPAPI）

# ProviderConfigPromptTemplateBox.Header
source: Prompt Template
zh_cn: Prompt 模板

# ProviderConfigLanguageMapBox.Header
source: Language Map (key=value per line)
zh_cn: 语言映射（每行 key=value）

# ProviderConfigSaveButton.Content
source: Save Config
zh_cn: 保存配置

# ProviderConfigReloadButton.Content
source: Reload
zh_cn: 重载

# ProviderConfigTestButton.Content
source: Test
zh_cn: 测试

# ProviderConfigImportButton.Content
source: Import ApiTranslator.txt
zh_cn: 导入 ApiTranslator.txt

# Status.UiLanguageChanged
source: UI language switched to '{0}'.
zh_cn: UI 语言已切换为“{0}”。

# Menu.OpenPlugin
source: Open Plugin...
zh_cn: 打开插件...

# Menu.Save
source: Save
zh_cn: 保存

# Menu.OpenAndAutoTranslate
source: Open + Auto Translate
zh_cn: 打开并自动翻译

# Menu.Paths
source: Paths
zh_cn: 路径

# Menu.Optional
source: Optional
zh_cn: 可选

# Menu.PluginPath
source: Plugin Path...
zh_cn: 插件路径...

# Menu.OutputPath
source: Output Path...
zh_cn: 输出路径...

# Menu.StringsDirectory
source: Strings Directory...
zh_cn: Strings 目录...

# Menu.RecordDefsPath
source: RecordDefs Path...
zh_cn: RecordDefs 路径...

# Menu.RunBatchTranslation
source: Run Batch Translation
zh_cn: 运行批量翻译

# Menu.Scope
source: Scope
zh_cn: 范围

# Menu.Selection
source: Selection
zh_cn: 选中项

# Menu.LoadStrings
source: Load STRINGS
zh_cn: 加载 STRINGS

# Menu.LoadRecordFields
source: Load Record Fields
zh_cn: 加载记录字段

# Menu.OnlyPendingRows
source: Only Pending Rows
zh_cn: 仅待翻译行

# Menu.IncludeLockedRows
source: Include Locked Rows
zh_cn: 包含锁定行

# Menu.CopySourceToTranslation
source: Copy Source to Translation
zh_cn: 复制源文到译文

# Menu.ApplyInspectorEdit
source: Apply Inspector Edit
zh_cn: 应用检查器编辑

# Menu.MarkSelectedValidated
source: Mark Selected Validated
zh_cn: 标记选中为已验证

# Menu.ToggleLock
source: Toggle Lock
zh_cn: 切换锁定

# Menu.ReloadMetadata
source: Reload Metadata
zh_cn: 重载元数据

# Menu.Chain
source: Model
zh_cn: 模型

# Menu.MoveSelectedUp
source: Move Selected Up
zh_cn: 上移选中项

# Menu.MoveSelectedDown
source: Move Selected Down
zh_cn: 下移选中项

# Menu.EnableAll
source: Enable All
zh_cn: 全部启用

# Menu.DisableAll
source: Disable All
zh_cn: 全部禁用

# Menu.CurrentChain
source: Current Model
zh_cn: 当前模型

# Menu.Configuration
source: Configuration
zh_cn: 配置

# Menu.OpenConfigurationWindow
source: Open Configuration Window
zh_cn: 打开配置窗口

# Menu.SaveSelectedProvider
source: Save Selected Provider
zh_cn: 保存当前 Provider

# Menu.ReloadSelectedProvider
source: Reload Selected Provider
zh_cn: 重载当前 Provider

# Menu.TestSelectedProvider
source: Test Selected Provider
zh_cn: 测试当前 Provider

# Menu.ImportApiTranslator
source: Import ApiTranslator.txt...
zh_cn: 导入 ApiTranslator.txt...

# Menu.Dictionary
source: Dictionary
zh_cn: 词典

# Menu.EditDictionary
source: Edit Dictionary...
zh_cn: 编辑词典...

# Menu.AddSelectedRowToDictionary
source: Add Selected Row to Dictionary
zh_cn: 将选中行加入词典

# Menu.EspCompare
source: ESP Compare
zh_cn: ESP 对比

# Menu.CompareWithEsp
source: Compare With ESP...
zh_cn: 选择 ESP 对比...

# Menu.ApplyEspCompareReplacements
source: Apply Compare Replacements
zh_cn: 应用对比替换

# Menu.ImportDictionary
source: Import Dictionary...
zh_cn: 导入词典...

# Menu.ExportDictionary
source: Export Dictionary...
zh_cn: 导出词典...

# Menu.EnableDictionaryPreReplace
source: Enable Dictionary Pre-Replace
zh_cn: 启用词典预替换

# Menu.CompatibilityModes
source: Compatibility Modes
zh_cn: 兼容模式

# Menu.CompatibilityPexMode
source: PEX Mode
zh_cn: PEX 模式

# Menu.OpenPexMode
source: Open PEX Mode...
zh_cn: 打开 PEX 模式...

# Menu.ExportPexStrings
source: Export PEX Strings...
zh_cn: 导出 PEX 字符串...

# Menu.CompatibilityMcmMode
source: MCM/XML Mode
zh_cn: MCM/XML 模式

# Menu.OpenMcmMode
source: Open MCM/XML Mode...
zh_cn: 打开 MCM/XML 模式...

# Menu.ExportMcmMode
source: Export MCM/XML...
zh_cn: 导出 MCM/XML...

# Menu.CompatibilityTxtMode
source: TXT/SST Mode
zh_cn: TXT/SST 模式

# Menu.OpenTxtMode
source: Open TXT/SST Mode...
zh_cn: 打开 TXT/SST 模式...

# Menu.ExportTxtMode
source: Export TXT/SST...
zh_cn: 导出 TXT/SST...

# Menu.RunTxtBatchScript
source: Run TXT Batch Script...
zh_cn: 运行 TXT 批处理脚本...

# DictionaryEditor.DialogTitle
source: Dictionary Editor
zh_cn: 词典编辑器

# DictionaryEditor.Search.Header
source: Search
zh_cn: 搜索

# DictionaryEditor.Search.PlaceholderText
source: Source / Target / EDID Scope / Field Scope
zh_cn: 源文 / 译文 / EDID 作用域 / 字段作用域

# DictionaryEditor.Sort.Header
source: Sort
zh_cn: 排序

# DictionaryEditor.Sort.SourceAsc
source: Source (A-Z)
zh_cn: 源文（A-Z）

# DictionaryEditor.Sort.TargetAsc
source: Target (A-Z)
zh_cn: 译文（A-Z）

# DictionaryEditor.Sort.Scope
source: Scope
zh_cn: 作用域

# DictionaryEditor.EntryCount.Text
source: Entries: {0}
zh_cn: 词条数：{0}

# DictionaryEditor.Source.Header
source: Source
zh_cn: 源文

# DictionaryEditor.Target.Header
source: Target
zh_cn: 译文

# DictionaryEditor.EditorIdScope.Header
source: EDID Scope
zh_cn: EDID 作用域

# DictionaryEditor.FieldScope.Header
source: Field Scope
zh_cn: 字段作用域

# DictionaryEditor.MatchCase.Header
source: Match Case
zh_cn: 区分大小写

# DictionaryEditor.WholeWord.Header
source: Whole Word
zh_cn: 整词匹配

# DictionaryEditor.ScopePreview.Header
source: Scope Preview
zh_cn: 作用域预览

# DictionaryEditor.ScopeGlobal.Text
source: Global
zh_cn: 全局

# DictionaryEditor.AddButton.Content
source: Add
zh_cn: 新增

# DictionaryEditor.DuplicateButton.Content
source: Duplicate
zh_cn: 复制

# DictionaryEditor.DeleteButton.Content
source: Delete
zh_cn: 删除

# DictionaryEditor.ApplyButton.Content
source: Apply
zh_cn: 应用

# DictionaryEditor.CloseButton.Content
source: Close
zh_cn: 关闭

# DictionaryEditor.PasteButton.Content
source: Paste CSV/TSV
zh_cn: 粘贴 CSV/TSV

# DictionaryEditor.PasteDialog.Title
source: Paste CSV/TSV Dictionary Entries
zh_cn: 粘贴 CSV/TSV 词典词条

# DictionaryEditor.Paste.PlaceholderText
source: Paste CSV/TSV lines here. Columns: source,target,editorIdPattern,fieldPattern,matchCase,wholeWord
zh_cn: 在此粘贴 CSV/TSV 行。列顺序：source,target,editorIdPattern,fieldPattern,matchCase,wholeWord

# DictionaryEditor.PasteApplyButton.Content
source: Parse And Add
zh_cn: 解析并添加

# DictionaryEditor.PasteCancelButton.Content
source: Cancel
zh_cn: 取消

# Menu.RefreshWorkspace
source: Refresh Workspace
zh_cn: 刷新工作区

# Menu.Filter
source: Filter
zh_cn: 筛选

# Menu.ShowLockedRows
source: Show Locked Rows
zh_cn: 显示锁定行

# Status.UiLanguageChangeFailed
source: UI language switch failed: {0}
zh_cn: UI 语言切换失败：{0}
